# Pandas Basic

## Using the Pandas Python Library

In [1]:
import numpy as np
import pandas as pd

## Getting to Know Pandasâ€™ Data Structures

### Understanding Series Objects

Struktur data paling dasar di Python adalah list, yang juga merupakan pengenalan dari objek series. 

Membuat objek Seri baru berdasarkan list:

Output yang dihasilkan berupa indeks, nilai, dan tipe data.

In [2]:
pd.Series([1200, 2000, 3000, 4000])
#series ; data struktur di pandas
# isinya values

0    1200
1    2000
2    3000
3    4000
dtype: int64

In [3]:
pd.Series([1200.0, 2000.0, 3000.0, 4000.0])

0    1200.0
1    2000.0
2    3000.0
3    4000.0
dtype: float64

In [4]:
pd.Series([1200.0, 2000, '3000', 4000.0]) #Object harus dibenerin

0    1200.0
1      2000
2      3000
3    4000.0
dtype: object

In [5]:
pd.Series(["Kyuhyun", "Ryeowook", "Yesung"])

0     Kyuhyun
1    Ryeowook
2      Yesung
dtype: object

In [7]:
#jangan lupa S kapital
revenues = pd.Series([5555, 7000, 1980])

In [8]:
# # simple array
# data = np.array([5555, 7000, 1980])
# revenues = pd.Series(data)
# print(revenues)

Membuat list [5555, 7000, 1980] untuk objek Series bernama revenues. Objek Seri terdiri dari dua komponen:

Urutan nilai
Urutan pengidentifikasi, yang merupakan indeks

Kita dapat mengakses komponen ini dengan .values dan .index, masing-masing:

In [9]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [10]:
revenues.values #untuk menampilkan list of values, semua value yang ada di sebuah series

array([5555, 7000, 1980], dtype=int64)

In [12]:
revenues.index 
#revenue ada index dan value
#indeks itu identitas dari values
#jika tidak menyebutkan index, maka output akan menampilakn indeks bawaan
# start=0, mulai dari angka 0
# stop=3, berhenti di angka aktual 3-1=2
# step nya 1

RangeIndex(start=0, stop=3, step=1)

Memberi indeks pada value:

In [13]:
pd.Series(
    [10,20,30,40,50], 
    index=["A","B","C","D","E"]
    )

A    10
B    20
C    30
D    40
E    50
dtype: int64

**Notes!!**
[ ] tipe data list, untuk mengakses elemen di list, indeks di list.

( ) tipe data tuple/ pemanggilan fungsi. biar fungsi bisa jalan

{} dictionary

**list** : "[]" "[1,2,3,4,5]", valluenya bisa diubah, variable[index]

**Tuple** : "()" (1,2,3,4,5) valuenya tidak bisa diubah

**Dict** : "{}" urutannya tidak masalah, dia punya key dan value, dict[key]

Indeks adalah daftar nama kota yang diwakili oleh tipe data string. 

- revenues: Seri ini seperti list pada Python karena hanya memiliki indeks posisi.
- city_revenues: Seri ini seperti dictionary Python karena menampilkan indeks posisi dan label.

In [15]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)

In [16]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [17]:
pd.Series({"Amesterdam" : 10, "Jakarta" : 20, "Magetan" : 50})

Amesterdam    10
Jakarta       20
Magetan       50
dtype: int64

Berikut cara membuat Seri dengan indeks label dari Python Dictionary:

In [18]:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [19]:
city_employee_count.values

array([5, 8], dtype=int64)

In [20]:
city_employee_count.index

Index(['Amsterdam', 'Tokyo'], dtype='object')

Dictionary keys menjadi indeks, dan dictionary values adalah nilai Seri.

Sama seperti dictionary, Seri juga bisa melakukan `.keys()`.

In [21]:
city_employee_count.keys() #fungsinya sama dengan index
# data tulisan akan ditulis object bukan string

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [22]:
#Mencari ada atau tidak
"Tokyo" in city_employee_count

True

In [23]:
"New York" in city_employee_count

False

### Understanding DataFrame Objects

Data series memiliki struktur data yang cukup kuat, sedangkan DataFrame memiliki keterbatasan. Contoh: hanya bisa menampilkan satu atribut per key.

Ada 2 objek series yang sudah dibuat sebelumnya:

- city_revenues
- city_employee_count

Kita bisa menggabungkan objek-objek ini ke dalam DataFrame. Dictionary key akan menjadi nama kolom, dan nilainya akan menjadi objek series.

In [24]:
# pd.DataFrame({
#   "nama kolom1": value dari series yg mau diambil
#   "nama kolom2": value dari series yg mau diambil
#   })
#() bisa diisi dictionary, list, dll

In [26]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [27]:
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

Membuat DataFrame city_data:

In [28]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [29]:
city_data

#jika tidak value, otomatis akan diisi NaN
#NaN not an number, missing values atau ga ada isinya

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [30]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

Sama seperti Seri, DataFrame juga menyimpan nilainya dalam array NumPy:

In [31]:
city_data.values
#menampilan value dalam scientific number

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

DataFrame memiliki dua axes:

- axes[0] : baris
- axes[1] : kolom

In [32]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [33]:
city_data.axes[0]
#akses indeks ke-bawah

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [34]:
city_data.axes[1]
#akses dindeks ke-samping

Index(['revenue', 'employee_count'], dtype='object')

Axes yang ditandai dengan 0 adalah indeks baris, dan sumbu yang ditandai dengan 1 adalah indeks kolom.

DataFrame juga merupakan struktur data seperti dictionary, sehingga juga mendukung .keys() dan kata kunci in. 

Namun, DataFrame, tidak bisa mencari nama indeks, tetapi hanya bisa mencari nama kolom:

In [35]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

In [36]:
city_data.columns

# menampilkan nama kolom

Index(['revenue', 'employee_count'], dtype='object')

In [39]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [40]:
"Amsterdam" in city_data

#tidak ada kolom yang namanya Amsterdam
#tidak bisa melihat indeks

False

In [41]:
"revenue" in city_data

#ada nama kolom yang namanya revenue

True

### Accessing Series Elements

Cara menggunakan dua metode akses khusus Panda:

- `.loc`
- `.iloc`

**Menggunakan Operator Pengindeksan**

Perlu diingat, Seri memiliki dua indeks:

- Indeks posisi atau implisit, yang selalu berupa Indeks Rentang
- Label atau indeks eksplisit, yang dapat berisi objek hashable.

In [42]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

Berapa nilai dari Toronto di DataFrame city_revenues

In [46]:
city_revenues["Toronto"]

8000

Berapa nilai dari Tokyo di DataFrame city_revenues

In [47]:
city_revenues["Tokyo"]

6500

Bisa juga menggunakan indeks dan irisan negatif, seperti pada list:

In [50]:
city_revenues[1]
#Nilai pada DataFrame city_revenues pada indeks ke-1

8000

In [52]:
city_revenues[-1]
#Nilai pada DataFrame city_revenues pada indeks terakhir

6500

In [53]:
city_revenues[1:]
#Nilai pada DataFrame city_revenues dari indeks ke-1 sampai akhir

Toronto    8000
Tokyo      6500
dtype: int64

In [54]:
city_revenues["Toronto":]
#Nilai pada DataFrame city_revenues dari indeks "Toronto" sampai akhir

Toronto    8000
Tokyo      6500
dtype: int64

**Using .loc and .iloc**

Operator pengindeksan `([])` mudah digunakan, tetapi ada peringatan. Bagaimana jika label (nama barisnya)nya juga angka?

In [55]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [56]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

Karena indeksnya tidak menampilkan urutan. Secara default, yang keluar langsung labelnya, bukan urutan, sehingga perlu .loc dan .iloc untuk mencari tahu posisi urutan

In [57]:
colors[5]

'green'

Kita dapat menggunakan fungsi `.loc` dan `.iloc`:

- .loc mengacu pada indeks label, nilai dari indeksnya
- .iloc mengacu pada indeks posisi, urutan dari indeksnya

Metode akses data ini jauh lebih mudah dibaca.

In [58]:
colors.loc[1]

'red'

In [61]:
colors.loc[2]

'purple'

In [62]:
colors.iloc[1]

'purple'

Mencari nilai pada DataFrame colors dari indeks posisi ke-1 sampai 2.

In [63]:
colors.iloc[1:3]

2    purple
3      blue
dtype: object

Mencari nilai dari DataFrame colors pada indeks label ke-3 sampai 8.

In [64]:
colors.loc[3:8]

3      blue
5     green
8    yellow
dtype: object

Mencari data colors pada indeks posisi 2 paling akhir

In [65]:
colors.iloc[-2]

'green'

### Accessing DataFrame Elements

Karena DataFrame terdiri dari objek Seri, kita dapat menggunakan tools yang sama untuk mengakses elemennya. Bedanya adalah dimensi tambahan dari DataFrame. Kita akan menggunakan operator pengindeksan untuk kolom dan metode akses `.loc` dan `.iloc` pada baris.

**Menggunakan Operator Pengindeksan**

Jika kita menganggap DataFrame sebagai kamus yang nilainya Seri, maka kita bisa mengakses kolomnya dengan operator pengindeksan:

In [66]:
city_data["revenue"]

#melihat kolom revenue

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [67]:
city_data.revenue

# Hasilnya sama dengan city_data["revenue"]

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

`city_data["revenue"]` dan `city_data.revenue` menampilkan output yang sama.


Ada satu situasi di mana mengakses elemen DataFrame dengan notasi titik mungkin tidak berfungsi atau dapat menyebabkan error. Ini adalah saat nama kolom bertepatan dengan atribut DataFrame atau nama metode:

In [70]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}
])

toys

           name   shape
0          ball  sphere
1  Rubik's cube    cube

In [71]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [72]:
toys.shape

(2, 2)

Pengindeksan `toys["shape"]` menampilkan data yang benar, tetapi `toys.shape `masih mengembalikan bentuk DataFrame. Kita hanya boleh menggunakan pengaksesan gaya-atribut dalam sesi interaktif atau untuk operasi baca. Kita tidak boleh menggunakannya untuk kode produksi atau untuk memanipulasi data (seperti mendefinisikan kolom baru).

**Menggunakan .loc dan .iloc**

Mirip dengan Seri, DataFrame juga menyediakan metode akses data `.loc` dan `.iloc`. Ingat, `.loc` menggunakan label dan `.iloc` indeks posisi:

In [76]:
city_data.loc["Amsterdam"]
# menampilkan nilai pada indeks label "Amsterdam"

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [77]:
city_data.loc["Tokyo": "Toronto"]
# menampilkan nilai pada indeks "Tokyo" sampai "Toronto"

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [78]:
city_data.iloc[1]
#menampilkan nilai pada indeks posisi ke-1

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

Menampilkan nilai pada indeks "Amsterdam" sampai "Tokyo", dan kolom yang dipilih hanya revenue

In [84]:
city_data.loc["Amsterdam": "Tokyo", "revenue"]

Amsterdam    4200
Tokyo        6500
Name: revenue, dtype: int64

Mencari jumlah atau total dari city_revenues:

In [85]:
city_revenues.sum()

18700

Mencari nilai maks dari city_revenues:

In [86]:
city_revenues.max()

8000

## Filter Pandas DataFrame with numpy

Membuat dataFrame menggunakan numpy:

In [88]:
dataFrame = pd.DataFrame({"Product": ["SmartTV", "ChromeCast", "Speaker", "Earphone"],
                          "Opening_Stock": [300, 700, 1200, 1500],
                          "Closing_Stock": [200, 500, 1000, 900]})

print("DataFrame...\n",dataFrame)

# using numpy where() to filter DataFrame with 2 Conditions
resValues1 = np.where((dataFrame['Opening_Stock']>=700) & (dataFrame['Closing_Stock']< 1000))

print("\nFiltered DataFrame Value = \n",dataFrame.loc[resValues1])

# using numpy where() to filter DataFrame with 3 conditions
resValues2 = np.where((dataFrame['Opening_Stock']>=500) & (dataFrame['Closing_Stock']< 1000) & (dataFrame['Product'].str.startswith('C')))

print("\nFiltered DataFrame Value = \n",dataFrame.loc[resValues2])

DataFrame...
       Product  Opening_Stock  Closing_Stock
0     SmartTV            300            200
1  ChromeCast            700            500
2     Speaker           1200           1000
3    Earphone           1500            900

Filtered DataFrame Value =
       Product  Opening_Stock  Closing_Stock
1  ChromeCast            700            500
3    Earphone           1500            900

Filtered DataFrame Value =
       Product  Opening_Stock  Closing_Stock
1  ChromeCast            700            500

## Combining Multiple Datasets

Kita akan menggunakan`.concat()` untuk menggabungkan city_data dengan DataFrame yang lain. Misal, menambahkan data dari beberapa kota:

In [89]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [90]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [91]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

DataFrame kedua ini berisi data kota "New York" dan "Barcelona".

Kita dapat menambahkan kota-kota ini ke city_data menggunakan `.concat()`:

pd.concat : objek yang mau digabung, bisa frame/series
pd.concat : ([dataPertama, dataKedua])

In [92]:
all_city_data = pd.concat([city_data, further_city_data], sort=False)
#sortnya di false biar gausah ngesort

In [93]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

Variabel baru `all_city_data` berisi nilai dari kedua objek DataFrame.

Secara default, `concat()` menggabungkan axis=0 atau baris. Kita juga dapat menggunakannya untuk menambahkan kolom dengan menambah `axis=1` sebelum `sort=False`:

In [94]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [95]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [96]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [97]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)

In [98]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [ ]:
# pandas.concat
# yang bisa dimasukin axis apa aja

Pandas secara otomatis menambahkan NaN untuk missing values.

Jika kita hanya ingin menggabungkan kota yang sama di kedua objek DataFrame, agar tidak ada data Nan, Kita dapat mengatur parameter join ke inner:

In [101]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [102]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [100]:
pd.concat([all_city_data, city_countries], axis=1, join="inner")

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

In [103]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [104]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [116]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

Kita bisa menambahkan parameter `left_on="country"` ke `.merge()` untuk menunjukkan kolom apa yang ingin digabungkan.

`left_on="country"` --> menggabungkan dua DataFrame berdasarkan kolom country.

In [107]:
pd.merge(
    cities, 
    countries, 
    left_on="country", 
    right_index=True
)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,6500.0,8.0,Japan,1.0,127,Asia
Toronto,8000.0,NaN,Canada,0.0,37,North America

`.merge()` digunakan untuk menggabungkan secara default. **Jika kita ingin memasukkan semua kota, maka kita perlu menambahkan parameter**:

In [108]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17.0,Europe
Tokyo,6500.0,8.0,Japan,1.0,127.0,Asia
Toronto,8000.0,NaN,Canada,0.0,37.0,North America
New York,7000.0,2.0,NaN,NaN,NaN,NaN
Barcelona,3400.0,2.0,Spain,0.0,NaN,NaN
Rotterdam,NaN,NaN,Holland,0.0,17.0,Europe